arr = [12, 5, 9, 21, 4, 7, 30, 15]
target = 21

count = 0
found_index = -1

for i, val in enumerate(arr):
    count += 1
    print(f"Analyzed value: {val}")
    if val == target:
        found_index = i
        break

print(f"Analyze count: {count}")
print(f"Found index: {found_index}")




# طرز کار Linear Search
# ایده‌ی اصلی این الگوریتم، ساده‌ترین و ابتدایی‌ترین روش جستجو است: از ابتدای آرایه شروع می‌کنیم و هر عنصر را یکی‌یکی با مقدار موردنظر مقایسه می‌کنیم تا زمانی که یا مقدار را پیدا کنیم یا به انتهای آرایه برسیم.
#
# به آن «جستجوی ترتیبی» (Sequential Search) هم می‌گویند، چون عناصر را به‌صورت ترتیبی و پشت‌سر هم بررسی می‌کند.
#
# مراحل گام‌به‌گام:
#
# از اولین عنصر آرایه (اندیس ۰) شروع کنید.
#
# عنصر جاری را با مقدار مورد جستجو (هدف - Target) مقایسه کنید.
#
# اگر برابر بودند، جستجو موفق بوده است. اندیس (موقعیت) آن عنصر را برگردانید و الگوریتم را تمام کنید.
#
# اگر برابر نبودند، یک قدم به عنصر بعدی بروید.
#
# مراحل ۲ تا ۴ را تکرار کنید تا زمانی که:
#
# یا عنصر مورد نظر را پیدا کنید (موفقیت).
#
# یا به انتهای آرایه برسید (یعنی تمام عناصر را بررسی کردید و هیچکدام برابر نبودند). در این صورت، جستجو ناموفق بوده است (معمولاً مقدار -1 یا null برمی‌گردانیم).
#


#
# مرتبه‌ی زمانی (پیچیدگی):
#
# بهترین حالت (آرایه مرتب نباشد، ولی هدف در اولین خانه باشد): O(1) — فقط یک مقایسه انجام می‌دهد.
#
# بدترین حالت (هدف در آخرین خانه باشد یا اصلاً وجود نداشته باشد): O(n) — مجبور است کل آرایه را پیمایش کند.
#
# حالت متوسط: O(n) — به طور میانگین باید نصف آرایه را پیمایش کند.
#
# مرتبه‌ی حافظه (فضای اضافی): O(1) — هیچ حافظه‌ی اضافی به جز چند متغیر ساده (مثل شمارنده‌ی حلقه) مصرف نمی‌کند.
#
# آیا به داده‌ی مرتب نیاز دارد؟ خیر. بزرگترین مزیت آن این است که روی آرایه‌های نامرتب هم به‌خوبی کار می‌کند (برخلاف جستجوی دودویی که حتماً به آرایه‌ی مرتب نیاز دارد).
#
# مزیت اصلی: پیاده‌سازی آن بسیار ساده است و برای آرایه‌های کوچک (چند صد عنصری) کاملاً کارآمد و سریع است. همچنین به‌راحتی روی ساختمان‌های داده‌ی دیگر (مثل لیست‌های پیوندی) قابل اجراست.
#
# معایب اصلی: برای آرایه‌های بزرگ، بسیار کند است. اگر میلیون‌ها داده داشته باشید، جستجوی خطی زمان غیرقابل قبولی مصرف می‌کند و باید از الگوریتم‌های پیشرفته‌تر (مانند جستجوی دودویی یا درخت‌های جستجو) استفاده کنید.