def selection_sort(arr):
    n = len(arr)
    comparisons = 0
    swaps = 0

    for i in range(n):
        min_index = i
        for j in range(i+1, n):
            comparisons += 1
            if arr[j] < arr[min_index]:
                min_index = j
        arr[i], arr[min_index] = arr[min_index], arr[i]
        swaps += 1

    return arr, comparisons, swaps

print(selection_sort([5, 3, 8, 0, 4, 2]))





# طرز کار Selection Sort
#
# ایده‌ی اصلی این الگوریتم خیلی ساده است:
# هر بار کوچک‌ترین عنصر را پیدا کن و آن را در اولین جای خالی (سمت چپ) قرار بده.
#
# به بیان دقیق‌تر، لیست را به دو بخش فرضی تقسیم می‌کند:
#
# بخش چپ: مرتب‌شده (در ابتدا خالی است).
#
# بخش راست: مرتب‌نشده (در ابتدا کل لیست است).
#
# مراحل گام‌به‌گام:
#
# از ابتدای آرایه (بخش مرتب‌نشده) شروع می‌کنیم.
#
# کل بخش مرتب‌نشده را پیمایش می‌کنیم تا کوچک‌ترین عنصر را پیدا کنیم و اندیس (موقعیت) آن را به خاطر بسپاریم.
#
# بعد از پیدا کردن کوچک‌ترین عنصر، آن را با اولین عنصر بخش مرتب‌نشده جابه‌جا (Swap) می‌کنیم.
#
# حالا آن عنصر به انتهای بخش مرتب‌شده رفته و بخش مرتب‌نشده یک خانه کوچک‌تر می‌شود.
#
# دوباره مرحله ۲ تا ۴ را برای بخش مرتب‌نشده‌ی جدید تکرار می‌کنیم. یعنی دوباره کوچک‌ترین عنصر را در بخش باقیمانده پیدا می‌کنیم و جلوی بخش مرتب‌شده قرار می‌دهیم.
#
# این کار را آنقدر ادامه می‌دهیم تا دیگر عنصری در بخش مرتب‌نشده باقی نماند.



# مرتبه‌ی زمانی (پیچیدگی): در بهترین، متوسط و بدترین حالت همگی O(n²) است. چون حتی اگر آرایه مرتب باشد، باز هم کل بخش مرتب‌نشده را برای پیدا کردن کوچک‌ترین عنصر پیمایش می‌کند.
#
# مرتبه‌ی حافظه (فضای اضافی): O(1) چون همه‌ی کارها را درون خود آرایه (In-place) و فقط با چند متغیر موقت انجام می‌دهد.
#
# آیا پایدار (Stable) است؟ خیر. اگر دو عدد مساوی داشته باشیم، ممکن است جای آن‌ها نسبت به هم عوض شود (به خاطر جابه‌جایی که انجام می‌دهد).
#
# مزیت مهم: تعداد جابه‌جایی‌ها (Swap) در این الگوریتم بسیار کم است. حداکثر n-1 بار جابه‌جایی انجام می‌دهد. پس اگر عملیات جابه‌جایی برای شما گران‌قیمت است (مثلاً نوشتن روی حافظه‌ی کم‌سرعت)، این گزینه‌ی خوبی است.

