def merge_sort(arr):
    if len(arr) <= 1:
        return arr, 0

    mid = len(arr)//2
    left, lc = merge_sort(arr[:mid])
    right, rc = merge_sort(arr[mid:])
    merged, mc = merge(left, right)
    return merged, lc + rc + mc

def merge(left, right):
    i = j = 0
    result = []
    comparisons = 0

    while i < len(left) and j < len(right):
        comparisons +=1
        if left[i] < right[j]:
            result.append(left[i])
            i += 1
        else:
            result.append(right[j])
            j += 1

    result.extend(left[i:])
    result.extend(right[j:])
    return result, comparisons

print(merge_sort([5, 3, 8, 0, 4, 2]))





# طرز کار Merge Sort
# ایده‌ی اصلی این الگوریتم، «تقسیم و حکومت» (Divide and Conquer) است. یعنی مسئله‌ی بزرگ را به کوچک‌ترین جزء ممکن می‌شکنیم، آن جزء کوچک را حل می‌کنیم (که خیلی ساده است)، و سپس جواب‌های کوچک را با هم ترکیب می‌کنیم تا به جواب نهایی برسیم.
#
# این الگوریتم کاملاً بازگشتی (Recursive) عمل می‌کند و دو مرحله‌ی اصلی دارد:
#
# مرحله‌ی ۱: تقسیم (Divide)
# آرایه را مدام از وسط به دو نیمه‌ی چپ و راست تقسیم می‌کند تا جایی که به آرایه‌هایی با یک عنصر برسد. (چون یک عنصر به تنهایی همیشه مرتب است).
#
# مرحله‌ی ۲: ادغام (Merge)
# حالا نوبت چسباندن است. دو آرایه‌ی کوچک مرتب کنار هم را برمی‌دارد، عناصرشان را با هم مقایسه می‌کند و یک آرایه‌ی مرتب‌شده‌ی بزرگتر می‌سازد. این کار را آنقدر تکرار می‌کند تا همه‌ی تکه‌ها به یک آرایه‌ی کامل و مرتب تبدیل شوند.




# مرتبه‌ی زمانی (پیچیدگی): در بهترین، متوسط و بدترین حالت، همگی O(n log n) هستند. چون آرایه را log n بار تقسیم می‌کند و در هر سطح، n عنصر را با هم مقایسه می‌کند. این الگوریتم عملکرد تضمینی دارد.
#
# مرتبه‌ی حافظه (فضای اضافی): O(n) — چون برای عملیات ادغام، به یک آرایه‌ی کمکی به اندازه‌ی کل آرایه نیاز دارد. پس درجا (In-place) نیست.
#
# آیا پایدار (Stable) است؟ بله. در مرحله‌ی ادغام، اگر دو عنصر مساوی از دو نیمه داشته باشیم، اول عنصر سمت چپ را برمی‌داریم. بنابراین ترتیب نسبی عناصر مساوی حفظ می‌شود.
#
# مزیت اصلی: سرعت بالا و تضمینی (حتی برای داده‌های خیلی بزرگ) و پایدار بودن. به همین دلیل برای مرتب‌سازی داده‌های حساس به ترتیب (مثل رکوردهای یک پایگاه داده) بسیار عالی است.
#
# معایب اصلی: مصرف حافظه‌ی اضافی (O(n) و عملکرد کمی کندتر از Quick Sort در عمل (به خاطر کپی کردن‌های زیاد بین آرایه‌ها).
